tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf25k40_tdd.h
#define PLEN0                         1649
#define PLEN                          1650
#define PLEN1                         1651
#define PLEN2                         1652
#define PLEN3                         1653
#define DLEN                          1654
#define DLEN0                         1655
#define DLEN1                         1656
#define DLEN2                         1657
#define DLEN3                         1658
#define NVMADRL                       1659
#define ADR0                          1660
#define ADR                           1661
#define NVMADR0                       1662
#define ADR1                          1663
#define NVMADR1                       1664
#define ADR2                          1665
#define NVMADR2                       1666
#define ADR3                          1667
#define NVMADR3                       1668
#define ADR4                          1669
#define NVMADR4                       1670
#define NVMADR5                       1671
#define ADR5                          1672
#define ADR6                          1673
#define NVMADR6                       1674
#define ADR7                          1675
#define NVMADR7                       1676
#define NVMDAT0                       1677
#define NVMDAT                        1678
#define NVMDAT1                       1679
#define NVMDAT2                       1680
#define NVMDAT3                       1681
#define NVMDAT4                       1682
#define NVMDAT5                       1683
#define NVMDAT6                       1684
#define NVMDAT7                       1685
#define NVMCON1                       1686
#define RD                            1687
#define WR                            1688
#define WREN                          1689
#define WRERR                         1690
#define FREE                          1691
#define NVMREG                        1692
#define NVMREG0                       1693
#define NVMREG1                       1694
#define NVMCON2                       1695
#define LATA                          1696
#define LATA0                         1697
#define LA0                           1698
#define LATA1                         1699
#define LA1                           1700
#define LATA2                         1701
#define LA2                           1702
#define LATA3                         1703
#define LA3                           1704
#define LATA4                         1705
#define LA4                           1706
#define LATA5                         1707
#define LA5                           1708
#define LATA6                         1709
#define LA6                           1710
#define LATA7                         1711
#define LA7                           1712
#define LATB                          1713
#define LB0                           1714
#define LATB0                         1715
#define LB1                           1716
#define LATB1                         1717
#define LB2                           1718
#define LATB2                         1719
#define LB3                           1720
#define LATB3                         1721
#define LB4                           1722
#define LATB4                         1723
#define LB5                           1724
#define LATB5                         1725
#define LB6                           1726
#define LATB6                         1727
#define LB7                           1728
#define LATB7                         1729
#define LATC                          1730
#define LATC0                         1731
#define LC0                           1732
#define LATC1                         1733
#define LC1                           1734
#define LATC2                         1735
#define LC2                           1736
#define LATC3                         1737
#define LC3                           1738
#define LATC4                         1739
#define LC4                           1740
#define LATC5                         1741
#define LC5                           1742
#define LATC6                         1743
#define LC6                           1744
#define LATC7                         1745
#define LC7                           1746
#define TRISA                         1747
#define TRISA0                        1748
#define TRISA_RA0                     1749
#define TRISA1                        1750
#define TRISA_RA1                     1751
#define TRISA2                        1752
#define TRISA_RA2                     1753
#define TRISA3                        1754
#define TRISA_RA3                     1755
#define TRISA_RA4                     1756
#define TRISA4                        1757
#define TRISA_RA5                     1758
#define TRISA5                        1759
#define TRISA_RA6                     1760
#define TRISA6                        1761
#define TRISA_RA7                     1762
#define TRISA7                        1763
#define TRISB                         1764
#define TRISB_RB0                     1765
#define TRISB0                        1766
#define TRISB_RB1                     1767
#define TRISB1                        1768
#define TRISB_RB2                     1769
#define TRISB2                        1770
#define TRISB_RB3                     1771
#define TRISB3                        1772
#define TRISB_RB4                     1773
#define TRISB4                        1774
#define TRISB_RB5                     1775
#define TRISB5                        1776
#define TRISB_RB6                     1777
#define TRISB6                        1778
#define TRISB_RB7                     1779
#define TRISB7                        1780
#define TRISC                         1781
#define TRISC0                        1782
#define TRISC_RC0                     1783
#define TRISC1                        1784
#define TRISC_RC1                     1785
#define TRISC2                        1786
#define TRISC_RC2                     1787
#define TRISC3                        1788
#define TRISC_RC3                     1789
#define TRISC4                        1790
#define TRISC_RC4                     1791
#define TRISC5                        1792
#define TRISC_RC5                     1793
#define TRISC6                        1794
#define TRISC_RC6                     1795
#define TRISC7                        1796
#define TRISC_RC7                     1797
#define PORTA                         1798
#define ULPWUIN                       1799
#define PORTA_RA0                     1800
#define PORTA_RA1                     1801
#define PORTA_RA2                     1802
#define PORTA_RA3                     1803
#define PORTA_RA4                     1804
#define LVDIN                         1805
#define PORTA_RA5                     1806
#define PORTA_RA6                     1807
#define PORTA_RA7                     1808
#define RJPU                          1809
#define PORTB                         1810
#define PORTB_RB0                     1811
#define PORTB_RB1                     1812
#define PORTB_RB2                     1813
#define CCP2_PA2                      1814
#define PORTB_RB3                     1815
#define PORTB_RB4                     1816
#define PORTB_RB5                     1817
#define PORTB_RB6                     1818
#define PORTB_RB7                     1819
#define PORTC                         1820
#define PORTC_RC0                     1821
#define PA2                           1822
#define PORTC_RC1                     1823
#define CCP2                          1824
#define PA1                           1825
#define PORTC_RC2                     1826
#define PORTC_RC3                     1827
#define PORTC_RC4                     1828
#define PORTC_RC5                     1829
#define PORTC_RC6                     1830
#define PORTC_RC7                     1831
#define PORTE                         1832
#define RE3                           1833
#define PC3E                          1834
#define CCP9E                         1835
#define SSP1BUF                       1836
#define SSPBUF                        1837
#define SSP1ADD                       1838
#define SSP1ADD_MSK0                  1839
#define MSK01                         1840
#define SSPADD                        1841
#define SSP1ADD_MSK1                  1842
#define MSK11                         1843
#define SSP1ADD_MSK2                  1844
#define MSK21                         1845
#define MSK31                         1846
#define SSP1ADD_MSK3                  1847
#define SSP1ADD_MSK4                  1848
#define MSK41                         1849
#define MSK51                         1850
#define SSP1ADD_MSK5                  1851
#define MSK61                         1852
#define SSP1ADD_MSK6                  1853
#define SSP1ADD_MSK7                  1854
#define MSK71                         1855
#define SSP1MSK                       1856
#define SSP1MSK_MSK0                  1857
#define SSPMSK                        1858
#define SSP1MSK_MSK1                  1859
#define SSP1MSK_MSK2                  1860
#define SSP1MSK_MSK3                  1861
#define SSP1MSK_MSK4                  1862
#define SSP1MSK_MSK5                  1863
#define SSP1MSK_MSK6                  1864
#define SSP1MSK_MSK7                  1865
#define SSP1STAT                      1866
#define BF                            1867
#define BF1                           1868
#define UA1                           1869
#define UA                            1870
#define R_NOT_W                       1871
#define READ_WRITE                    1872
#define RW1                           1873
#define R_W                           1874
#define nW                            1875
#define RW                            1876
#define nWRITE                        1877
#define R                             1878
#define NOT_WRITE                     1879
#define R_nW                          1880
#define I2C_READ                      1881
#define START                         1882
#define START1                        1883
#define S                             1884
#define I2C_START                     1885
#define STOP                          1886
#define STOP1                         1887
#define I2C_STOP                      1888
#define P                             1889
#define DATA_ADDRESS                  1890
#define nA                            1891
#define D_A                           1892
#define D_nA                          1893
#define D                             1894
#define DA1                           1895
#define DA                            1896
#define D_NOT_A                       1897
#define NOT_ADDRESS                   1898
#define nADDRESS                      1899
#define I2C_DAT                       1900
#define CKE                           1901
#define CKE1                          1902
#define SMP                           1903
#define SMP1                          1904
#define SSP1CON1                      1905
#define SSPM0                         1906
#define SSPM                          1907
#define SSPM01                        1908
#define SSPM1                         1909
#define SSPM11                        1910
#define SSPM2                         1911
#define SSPM21                        1912
#define SSPM31                        1913
#define SSPM3                         1914
#define CKP                           1915
#define CKP1                          1916
#define SSPEN                         1917
#define SSPEN1                        1918
#define SSPOV1                        1919
#define SSPOV                         1920
#define WCOL1                         1921
#define WCOL                          1922
#define SSP1CON2                      1923
#define SEN1                          1924
#define SSP1CON2_SEN                  1925
#define ADMSK11                       1926
#define ADMSK                         1927
#define RSEN1                         1928
#define RSEN                          1929
#define ADMSK1                        1930
#define PEN                           1931
#define ADMSK21                       1932
#define PEN1                          1933
#define ADMSK2                        1934
#define ADMSK31                       1935
#define RCEN                          1936
#define RCEN1                         1937
#define ADMSK3                        1938
#define ACKEN                         1939
#define ACKEN1                        1940
#define ADMSK41                       1941
#define ADMSK4                        1942
#define ACKDT1                        1943
#define ADMSK51                       1944
#define ADMSK5                        1945
#define ACKDT                         1946
#define ACKSTAT                       1947
#define ACKSTAT1                      1948
#define GCEN                          1949
#define GCEN1                         1950
#define SSP1CON3                      1951
#define DHEN                          1952
#define AHEN                          1953
#define SBCDE                         1954
#define SDAHT                         1955
#define BOEN                          1956
#define SCIE                          1957
#define PCIE                          1958
#define ACKTIM                        1959
#define RC1REG                        1960
#define TX1REG                        1961
#define SP1BRGL                       1962
#define SP1BRGH                       1963
#define RC1STA                        1964
#define RCD8                          1965
#define RX9D                          1966
#define OERR                          1967
#define FERR                          1968
#define ADDEN                         1969
#define CREN                          1970
#define SREN                          1971
#define SRENA                         1972
#define RC8_9                         1973
#define RC9                           1974
#define RX9                           1975
#define SPEN                          1976
#define TX1STA                        1977
#define TXD8                          1978
#define TX9D1                         1979
#define TX9D                          1980
#define TRMT                          1981
#define TRMT1                         1982
#define BRGH1                         1983
#define BRGH                          1984
#define SENDB1                        1985
#define SENDB                         1986
#define TX1STA_SYNC                   1987
#define SYNC1                         1988
#define TXEN1                         1989
#define TXEN                          1990
#define TX91                          1991
#define TX8_9                         1992
#define TX9                           1993
#define CSRC1                         1994
#define CSRC                          1995
#define BAUD1CON                      1996
#define ABDEN1                        1997
#define ABDEN                         1998
#define WUE1                          1999
#define WUE                           2000
#define W4E                           2001
#define BRG16                         2002
#define BRG161                        2003
#define SCKP                          2004
#define TXCKP                         2005
#define SCKP1                         2006
#define TXCKP1                        2007
#define CKTXP                         2008
#define RCMT                          2009
#define RCIDL                         2010
#define RCIDL1                        2011
#define RCMT1                         2012
#define ABDOVF                        2013
#define ABDOVF1                       2014
#define PWM4DCL                       2015
#define PWM4DCL_PWMPW0                2016
#define PWM4DCL_DC                    2017
#define PWM4DC0                       2018
#define PWM4DCL_DC0                   2019
#define PWM4DCL_PWMPW1                2020
#define PWM4DC1                       2021
#define PWM4DCL_DC1                   2022
#define PWM4DCH                       2023
#define PWM4DCH_PWMPW2                2024
#define PWM4DCH_DC                    2025
#define PWM4DC2                       2026
#define PWM4DCH_DC2                   2027
#define PWM4DCH_PWMPW3                2028
#define PWM4DC3                       2029
#define PWM4DCH_DC3                   2030
#define PWM4DCH_PWMPW4                2031
#define PWM4DC4                       2032
#define PWM4DCH_DC4                   2033
#define PWM4DCH_PWMPW5                2034
#define PWM4DC5                       2035
#define PWM4DCH_DC5                   2036
#define PWM4DCH_PWMPW6                2037
#define PWM4DC6                       2038
#define PWM4DCH_DC6                   2039
#define PWM4DCH_PWMPW7                2040
#define PWM4DC7                       2041
#define PWM4DCH_DC7                   2042
#define PWM4DCH_PWMPW8                2043
#define PWM4DC8                       2044
#define PWM4DCH_DC8                   2045
#define PWM4DCH_PWMPW9                2046
#define PWM4DC9                       2047
#define PWM4DCH_DC9                   2048
#define PWM4CON                       2049
#define PWM4POL                       2050
#define PWM4CON_POL                   2051
#define PWM4CON_OUT                   2052
#define PWM4OUT                       2053
#define PWM4EN                        2054
#define PWM4CON_EN                    2055
#define PWM3DCL                       2056
#define PWM3DC0                       2057
#define PWM3DCL_PWMPW0                2058
#define PWM3DCL_DC0                   2059
#define PWM3DCL_DC                    2060
#define PWM3DC1                       2061
#define PWM3DCL_PWMPW1                2062
#define PWM3DCL_DC1                   2063
#define PWM3DCH                       2064
#define PWM3DC2                       2065
#define PWM3DCH_DC2                   2066
#define PWM3DCH_DC                    2067
#define PWM3DCH_PWMPW2                2068
#define PWM3DC3                       2069
#define PWM3DCH_DC3                   2070
#define PWM3DCH_PWMPW3                2071
#define PWM3DC4                       2072
#define PWM3DCH_DC4                   2073
#define PWM3DCH_PWMPW4                2074
#define PWM3DC5                       2075
#define PWM3DCH_DC5                   2076
#define PWM3DCH_PWMPW5                2077
#define PWM3DC6                       2078
#define PWM3DCH_DC6                   2079
#define PWM3DCH_PWMPW6                2080
#define PWM3DC7                       2081
#define PWM3DCH_DC7                   2082
#define PWM3DCH_PWMPW7                2083
#define PWM3DC8                       2084
#define PWM3DCH_DC8                   2085
#define PWM3DCH_PWMPW8                2086
#define PWM3DC9                       2087
#define PWM3DCH_DC9                   2088
#define PWM3DCH_PWMPW9                2089
#define PWM3CON                       2090
#define PWM3CON_POL                   2091
#define PWM3POL                       2092
#define PWM3CON_OUT                   2093
#define PWM3OUT                       2094
#define PWM3EN                        2095
#define PWM3CON_EN                    2096
#define CCPR2L                        2097
#define CCPR2L_RL                     2098
#define CCPR2H                        2099
#define CCPR2H_RH                     2100
#define CCP2CON                       2101
#define CCP2MODE                      2102
#define CCP2MODE0                     2103
#define CCP2CON_MODE0                 2104
#define CCP2CON_MODE                  2105
#define CCP2MODE1                     2106
#define CCP2CON_MODE1                 2107
#define CCP2MODE2                     2108
#define CCP2CON_MODE2                 2109
#define CCP2MODE3                     2110
#define CCP2CON_MODE3                 2111
#define CCP2FMT                       2112
#define CCP2CON_FMT                   2113
#define CCP2OUT                       2114
#define CCP2CON_OUT                   2115
#define CCP2EN                        2116
#define CCP2CON_EN                    2117
#define CCP2CAP                       2118
#define CCP2CAP_CTS                   2119
#define CCP2CAP_CTS0                  2120
#define CCP2CTS                       2121
#define CCP2CTS0                      2122
#define CCP2CAP_CTS1                  2123
#define CCP2CTS1                      2124
#define CCPR1L                        2125
#define CCPR1L_RL                     2126
#define CCPR1H                        2127
#define CCPR1H_RH                     2128
#define CCP1CON                       2129
#define CCP1MODE0                     2130
#define CCP1CON_MODE0                 2131
#define CCP1CON_MODE                  2132
#define CCP1MODE                      2133
#define CCP1MODE1                     2134
#define CCP1CON_MODE1                 2135
#define CCP1MODE2                     2136
#define CCP1CON_MODE2                 2137
#define CCP1MODE3                     2138
#define CCP1CON_MODE3                 2139
#define CCP1FMT                       2140
#define CCP1CON_FMT                   2141
#define CCP1CON_OUT                   2142
#define CCP1OUT                       2143
#define CCP1EN                        2144
#define CCP1CON_EN                    2145
#define P1M1                          2146
#define CCP1CAP                       2147
#define CCP1CTS0                      2148
#define CCP1CAP_CTS                   2149
#define CCP1CAP_CTS0                  2150
#define CCP1CTS                       2151
#define CCP1CTS1                      2152
#define CCP1CAP_CTS1                  2153
#define CCPTMRS                       2154
#define C1TSEL0                       2155
#define C1TSEL                        2156
#define C1TSEL1                       2157
#define C2TSEL0                       2158
#define C2TSEL                        2159
#define C2TSEL1                       2160
#define P3TSEL                        2161
#define P3TSEL0                       2162
#define P3TSEL1                       2163
#define P4TSEL0                       2164
#define P4TSEL                        2165
#define P4TSEL1                       2166
#define T6TMR                         2167
#define TMR6                          2168
#define T6PR                          2169
#define PR6                           2170
#define T6CON                         2171
#define T6CON_OUTPS0                  2172
#define T6OUTPS                       2173
#define T6CON_OUTPS                   2174
#define T6OUTPS0                      2175
#define T6CON_OUTPS1                  2176
#define T6OUTPS1                      2177
#define T6CON_OUTPS2                  2178
#define T6OUTPS2                      2179
#define T6CON_OUTPS3                  2180
#define T6OUTPS3                      2181
#define T6CON_CKPS0                   2182
#define T6CKPS                        2183
#define T6CKPS0                       2184
#define T6CON_CKPS                    2185
#define T6CON_CKPS1                   2186
#define T6CKPS1                       2187
#define T6CON_CKPS2                   2188
#define T6CKPS2                       2189
#define TMR6ON                        2190
#define T6ON                          2191
#define T6CON_ON                      2192
#define T6HLT                         2193
#define T6HLT_MODE0                   2194
#define T6HLT_MODE                    2195
#define T6MODE0                       2196
#define T6MODE                        2197
#define T6HLT_MODE1                   2198
#define T6MODE1                       2199
#define T6MODE2                       2200
#define T6HLT_MODE2                   2201
#define T6HLT_MODE3                   2202
#define T6MODE3                       2203
#define T6MODE4                       2204
#define T6HLT_MODE4                   2205
#define T6CKSYNC                      2206
