tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf25k40_tdd.h
#define T6HLT_CKSYNC                  2207
#define T6CKPOL                       2208
#define T6HLT_CKPOL                   2209
#define T6PSYNC                       2210
#define T6HLT_PSYNC                   2211
#define T6CLKCON                      2212
#define T6CS                          2213
#define T6CS0                         2214
#define T6CS1                         2215
#define T6CS2                         2216
#define T6CS3                         2217
#define T6RST                         2218
#define T6RST_RSEL                    2219
#define T6RST_RSEL0                   2220
#define T6RSEL                        2221
#define T6RSEL0                       2222
#define T6RST_RSEL1                   2223
#define T6RSEL1                       2224
#define T6RSEL2                       2225
#define T6RST_RSEL2                   2226
#define T6RST_RSEL3                   2227
#define T6RSEL3                       2228
#define T4TMR                         2229
#define TMR4                          2230
#define T4PR                          2231
#define PR4                           2232
#define T4CON                         2233
#define T4OUTPS0                      2234
#define T4CON_OUTPS                   2235
#define T4OUTPS                       2236
#define T4CON_OUTPS0                  2237
#define T4OUTPS1                      2238
#define T4CON_OUTPS1                  2239
#define T4CON_OUTPS2                  2240
#define T4OUTPS2                      2241
#define T4OUTPS3                      2242
#define T4CON_OUTPS3                  2243
#define T4CON_CKPS0                   2244
#define T4CKPS0                       2245
#define T4CON_CKPS                    2246
#define T4CKPS                        2247
#define T4CKPS1                       2248
#define T4CON_CKPS1                   2249
#define T4CKPS2                       2250
#define T4CON_CKPS2                   2251
#define T4ON                          2252
#define T4CON_ON                      2253
#define TMR4ON                        2254
#define T4HLT                         2255
#define T4MODE                        2256
#define T4HLT_MODE                    2257
#define T4HLT_MODE0                   2258
#define T4MODE0                       2259
#define T4HLT_MODE1                   2260
#define T4MODE1                       2261
#define T4HLT_MODE2                   2262
#define T4MODE2                       2263
#define T4HLT_MODE3                   2264
#define T4MODE3                       2265
#define T4HLT_MODE4                   2266
#define T4MODE4                       2267
#define T4HLT_CKSYNC                  2268
#define T4CKSYNC                      2269
#define T4HLT_CKPOL                   2270
#define T4CKPOL                       2271
#define T4PSYNC                       2272
#define T4HLT_PSYNC                   2273
#define T4CLKCON                      2274
#define T4CS0                         2275
#define T4CS                          2276
#define T4CS1                         2277
#define T4CS2                         2278
#define T4CS3                         2279
#define T4RST                         2280
#define T4RSEL0                       2281
#define T4RSEL                        2282
#define T4RST_RSEL                    2283
#define T4RST_RSEL0                   2284
#define T4RSEL1                       2285
#define T4RST_RSEL1                   2286
#define T4RSEL2                       2287
#define T4RST_RSEL2                   2288
#define T4RSEL3                       2289
#define T4RST_RSEL3                   2290
#define T2TMR                         2291
#define TMR2                          2292
#define T2PR                          2293
#define PR2                           2294
#define T2CON                         2295
#define T2OUTPS0                      2296
#define T2CON_OUTPS0                  2297
#define T2OUTPS                       2298
#define T2CON_OUTPS                   2299
#define T2OUTPS1                      2300
#define T2CON_OUTPS1                  2301
#define T2OUTPS2                      2302
#define T2CON_OUTPS2                  2303
#define T2OUTPS3                      2304
#define T2CON_OUTPS3                  2305
#define T2CKPS0                       2306
#define T2CON_CKPS                    2307
#define T2CKPS                        2308
#define T2CON_CKPS0                   2309
#define T2CKPS1                       2310
#define T2CON_CKPS1                   2311
#define T2CKPS2                       2312
#define T2CON_CKPS2                   2313
#define T2CON_ON                      2314
#define TMR2ON                        2315
#define T2ON                          2316
#define T2HLT                         2317
#define T2HLT_MODE                    2318
#define T2MODE                        2319
#define T2MODE0                       2320
#define T2HLT_MODE0                   2321
#define T2MODE1                       2322
#define T2HLT_MODE1                   2323
#define T2MODE2                       2324
#define T2HLT_MODE2                   2325
#define T2MODE3                       2326
#define T2HLT_MODE3                   2327
#define T2MODE4                       2328
#define T2HLT_MODE4                   2329
#define T2HLT_CKSYNC                  2330
#define T2CKSYNC                      2331
#define T2HLT_CKPOL                   2332
#define T2CKPOL                       2333
#define T2PSYNC                       2334
#define T2HLT_PSYNC                   2335
#define T2CLKCON                      2336
#define T2CS                          2337
#define T2CS0                         2338
#define T2CS1                         2339
#define T2CS2                         2340
#define T2CS3                         2341
#define T2RST                         2342
#define T2RSEL0                       2343
#define T2RST_RSEL                    2344
#define T2RSEL                        2345
#define T2RST_RSEL0                   2346
#define T2RSEL1                       2347
#define T2RST_RSEL1                   2348
#define T2RST_RSEL2                   2349
#define T2RSEL2                       2350
#define T2RSEL3                       2351
#define T2RST_RSEL3                   2352
#define TMR5L                         2353
#define TMR5L0                        2354
#define TMR5L1                        2355
#define TMR5L2                        2356
#define TMR5L3                        2357
#define TMR5L4                        2358
#define TMR5L5                        2359
#define TMR5L6                        2360
#define TMR5L7                        2361
#define TMR5H0                        2362
#define TMR5H                         2363
#define TMR5H1                        2364
#define TMR5H2                        2365
#define TMR5H3                        2366
#define TMR5H4                        2367
#define TMR5H5                        2368
#define TMR5H6                        2369
#define TMR5H7                        2370
#define T5CON                         2371
#define T5CON_ON                      2372
#define TMR5ON                        2373
#define T5CON_RD16                    2374
#define T5RD16                        2375
#define RD165                         2376
#define nT5SYNC                       2377
#define T5CON_nSYNC                   2378
#define T5CON_NOT_SYNC                2379
#define NOT_T5SYNC                    2380
#define T5CON_CKPS0                   2381
#define T5CON_CKPS                    2382
#define T5CKPS0                       2383
#define T5CON_CKPS1                   2384
#define T5CKPS1                       2385
#define T5GCON                        2386
#define T5GCON_GVAL                   2387
#define T5GVAL                        2388
#define T5GGO_nDONE                   2389
#define T5GCON_GGO_NOT_DONE           2390
#define T5GCON_GGO_nDONE              2391
#define T5GGO_NOT_DONE                2392
#define T5GGO                         2393
#define T5GCON_GSPM                   2394
#define T5GSPM                        2395
#define T5GTM                         2396
#define T5GCON_GTM                    2397
#define T5GPOL                        2398
#define T5GCON_GPOL                   2399
#define T5GCON_GE                     2400
#define T5GE                          2401
#define T5GATE                        2402
#define T5GATE_GSS0                   2403
#define T5GSS0                        2404
#define T5GATE_GSS                    2405
#define T5GATE_GSS1                   2406
#define T5GSS1                        2407
#define T5GATE_GSS2                   2408
#define T5GSS2                        2409
#define T5GATE_GSS3                   2410
#define T5GSS3                        2411
#define T5CLK                         2412
#define T5CS0                         2413
#define T5CLK_CS                      2414
#define T5CLK_CS0                     2415
#define T5CS1                         2416
#define T5CLK_CS1                     2417
#define T5CS2                         2418
#define T5CLK_CS2                     2419
#define T5CS3                         2420
#define T5CLK_CS3                     2421
#define TMR3L0                        2422
#define TMR3L                         2423
#define TMR3L1                        2424
#define TMR3L2                        2425
#define TMR3L3                        2426
#define TMR3L4                        2427
#define TMR3L5                        2428
#define TMR3L6                        2429
#define TMR3L7                        2430
#define TMR3H                         2431
#define TMR3H0                        2432
#define TMR3H1                        2433
#define TMR3H2                        2434
#define TMR3H3                        2435
#define TMR3H4                        2436
#define TMR3H5                        2437
#define TMR3H6                        2438
#define TMR3H7                        2439
#define T3CON                         2440
#define T3CON_ON                      2441
#define TMR3ON                        2442
#define T3CON_RD16                    2443
#define RD163                         2444
#define T3RD16                        2445
#define T3CON_NOT_SYNC                2446
#define T3CON_nSYNC                   2447
#define NOT_T3SYNC                    2448
#define nT3SYNC                       2449
#define T3CKPS0                       2450
#define T3CON_CKPS0                   2451
#define T3CON_CKPS                    2452
#define T3CKPS1                       2453
#define T3CON_CKPS1                   2454
#define T3GCON                        2455
#define T3GVAL                        2456
#define T3GCON_GVAL                   2457
#define T3GGO                         2458
#define T3GGO_NOT_DONE                2459
#define T3GCON_GGO_nDONE              2460
#define T3GGO_nDONE                   2461
#define T3GCON_GGO_NOT_DONE           2462
#define T3GCON_GSPM                   2463
#define T3GSPM                        2464
#define T3GCON_GTM                    2465
#define T3GTM                         2466
#define T3GCON_GPOL                   2467
#define T3GPOL                        2468
#define T3GCON_GE                     2469
#define T3GE                          2470
#define T3GATE                        2471
#define T3GSS0                        2472
#define T3GATE_GSS0                   2473
#define T3GATE_GSS                    2474
#define T3GSS1                        2475
#define T3GATE_GSS1                   2476
#define T3GSS2                        2477
#define T3GATE_GSS2                   2478
#define T3GSS3                        2479
#define T3GATE_GSS3                   2480
#define T3CLK                         2481
#define T3CLK_CS                      2482
#define T3CLK_CS0                     2483
#define T3CS0                         2484
#define T3CLK_CS1                     2485
#define T3CS1                         2486
#define T3CLK_CS2                     2487
#define T3CS2                         2488
#define T3CS3                         2489
#define T3CLK_CS3                     2490
#define TMR1L                         2491
#define TMR1L0                        2492
#define TMR1L1                        2493
#define TMR1L2                        2494
#define TMR1L3                        2495
#define TMR1L4                        2496
#define TMR1L5                        2497
#define TMR1L6                        2498
#define TMR1L7                        2499
#define TMR1H0                        2500
#define TMR1H                         2501
#define TMR1H1                        2502
#define TMR1H2                        2503
#define TMR1H3                        2504
#define TMR1H4                        2505
#define TMR1H5                        2506
#define TMR1H6                        2507
#define TMR1H7                        2508
#define T1CON                         2509
#define TMR1ON                        2510
#define T1CON_ON                      2511
#define T1CON_RD16                    2512
#define T1RD16                        2513
#define NOT_T1SYNC                    2514
#define T1CON_nSYNC                   2515
#define nT1SYNC                       2516
#define T1CON_NOT_SYNC                2517
#define T1CON_CKPS0                   2518
#define T1CKPS0                       2519
#define T1CON_CKPS                    2520
#define T1CKPS1                       2521
#define T1CON_CKPS1                   2522
#define T1GCON                        2523
#define T1GCON_GVAL                   2524
#define T1GVAL                        2525
#define T1GGO_NOT_DONE                2526
#define T1GGO_nDONE                   2527
#define T1GCON_GGO_nDONE              2528
#define T1GCON_GGO_NOT_DONE           2529
#define T1GGO                         2530
#define T1GCON_GSPM                   2531
#define T1GSPM                        2532
#define T1GTM                         2533
#define T1GCON_GTM                    2534
#define T1GPOL                        2535
#define T1GCON_GPOL                   2536
#define T1GCON_GE                     2537
#define T1GE                          2538
#define T1GATE                        2539
#define T1GATE_GSS0                   2540
#define T1GSS0                        2541
#define T1GATE_GSS                    2542
#define T1GATE_GSS1                   2543
#define T1GSS1                        2544
#define T1GSS2                        2545
#define T1GATE_GSS2                   2546
#define T1GSS3                        2547
#define T1GATE_GSS3                   2548
#define T1CLK                         2549
#define T1CS0                         2550
#define T1CLK_CS                      2551
#define T1CLK_CS0                     2552
#define T1CLK_CS1                     2553
#define T1CS1                         2554
#define T1CS2                         2555
#define T1CLK_CS2                     2556
#define T1CS3                         2557
#define T1CLK_CS3                     2558
#define TMR0L0                        2559
#define TMR0L                         2560
#define TMR0L1                        2561
#define TMR0L2                        2562
#define TMR0L3                        2563
#define TMR0L4                        2564
#define TMR0L5                        2565
#define TMR0L6                        2566
#define TMR0L7                        2567
#define TMR0H0                        2568
#define T0PR                          2569
#define TMR0H                         2570
#define T0PR0                         2571
#define TMR0H1                        2572
#define T0PR1                         2573
#define TMR0H2                        2574
#define T0PR2                         2575
#define TMR0H3                        2576
#define T0PR3                         2577
#define TMR0H4                        2578
#define T0PR4                         2579
#define TMR0H5                        2580
#define T0PR5                         2581
#define TMR0H6                        2582
#define T0PR6                         2583
#define TMR0H7                        2584
#define T0PR7                         2585
#define T0CON0                        2586
#define T0OUTPS                       2587
#define T0OUTPS0                      2588
#define T0OUTPS1                      2589
#define T0OUTPS2                      2590
#define T0OUTPS3                      2591
#define T016BIT                       2592
#define T0OUT                         2593
#define T0EN                          2594
#define T0CON1                        2595
#define T0PS                          2596
#define T0CKPS                        2597
#define T0CKPS0                       2598
#define T0PS0                         2599
#define T0CKPS1                       2600
#define T0PS1                         2601
#define T0CKPS2                       2602
#define T0PS2                         2603
#define T0CKPS3                       2604
#define T0PS3                         2605
#define T0ASYNC                       2606
#define T0CS                          2607
#define T0CS0                         2608
#define T0CS1                         2609
#define T0CS2                         2610
#define PCON0                         2611
#define BOR                           2612
#define NOT_BOR                       2613
#define nBOR                          2614
#define POR                           2615
#define nPOR                          2616
#define NOT_POR                       2617
#define nRI                           2618
#define NOT_RI                        2619
#define RI                            2620
#define NOT_RMCLR                     2621
#define nRMCLR                        2622
#define RMCLR                         2623
#define NOT_RWDT                      2624
#define nRWDT                         2625
#define RWDT                          2626
#define nWDTWV                        2627
#define WDTWV                         2628
#define NOT_WDTWV                     2629
#define STKUNF                        2630
#define STKOVF                        2631
#define STATUS                        2632
#define C                             2633
#define CARRY                         2634
#define STATUS_DC                     2635
#define ZERO                          2636
#define Z                             2637
#define OV                            2638
#define OVERFLOW                      2639
#define N                             2640
#define NEGATIVE                      2641
#define PD                            2642
#define nPD                           2643
#define NOT_PD                        2644
#define TO                            2645
#define NOT_TO                        2646
#define nTO                           2647
#define FSR2L                         2648
#define PLUSW2                        2649
#define PREINC2                       2650
#define POSTDEC2                      2651
#define POSTINC2                      2652
#define INDF2                         2653
#define FSR1L                         2654
#define PLUSW1                        2655
#define PREINC1                       2656
#define POSTDEC1                      2657
#define POSTINC1                      2658
#define INDF1                         2659
#define WREG                          2660
#define FSR0L                         2661
#define PLUSW0                        2662
#define PREINC0                       2663
#define POSTDEC0                      2664
#define POSTINC0                      2665
#define INDF0                         2666
#define INTCON                        2667
#define INT0EDG                       2668
#define INT1EDG                       2669
#define INT2EDG                       2670
#define IPEN                          2671
#define PEIE                          2672
#define PEIE_GIEL                     2673
#define GIEL                          2674
#define GIE                           2675
#define GIE_GIEH                      2676
#define GIEH                          2677
#define PRODL                         2678
#define PRODH                         2679
#define TABLAT                        2680
#define TBLPTRL                       2681
#define TBLPTRH                       2682
#define TBLPTRU                       2683
#define ACSS                          2684
#define PCL                           2685
#define PCLATH                        2686
#define PCLATH_PCH                    2687
#define PCLATU                        2688
#define PCU                           2689
#define STKPTR0                       2690
#define STKPTR                        2691
#define SP0                           2692
#define STKPTR1                       2693
#define SP1                           2694
#define STKPTR2                       2695
#define SP2                           2696
#define SP3                           2697
#define STKPTR3                       2698
#define STKPTR4                       2699
#define SP4                           2700
#define STKPTR5                       2701
#define SP5                           2702
#define TOSL                          2703
#define TOSH                          2704

#endif // _PIC18LF25K40_H_
